# ── CachyOS Repo (not present on stock Arch) ───────────────────────────────────
# These ship from the CachyOS repositories and have no plain-Arch equivalent.
cachyos-keyring
cachyos-mirrorlist
cachyos-v3-mirrorlist
cachyos-rate-mirrors
cachyos-settings
cachyos-hello
cachyos-kernel-manager
cachyos-fish-config
cachyos-zsh-config
cachy-browser
chwd
octopi
paru
fish
linux-cachyos
linux-cachyos-headers

# ── Terminal & Shell ──────────────────────────────────────────────────────────
bash-completion
bat
btop
bpytop
fzf
htop
man
man-db
nano
ranger
sl
starship
#tldr
tree
vi
vim
yazi
lutris
protontricks
proton-vpn-gtk-app

# ── Development ───────────────────────────────────────────────────────────────
base-devel
bzip2
cargo
clang
cmake
curl
dkms
docker
docker-compose
#exfat-utils
gcc
git
go
jdk-openjdk
jdk17-openjdk
jre8-openjdk
jupyter-notebook
make
neovim
ninja
nodejs
npm
openssl
pyenv
python-pip
python-pipx
python-pyqt6
tk
uv
wget
xz
#zlib
apostrophe

# ── NVIDIA & GPU ──────────────────────────────────────────────────────────────
# Prefer `sudo chwd -a` (CachyOS Hardware Detection) over manual driver installs.
cuda
lib32-nvidia-utils
lib32-vulkan-intel
libva-nvidia-driver
nvidia-container-toolkit
nvidia-open-dkms
nvidia-settings
nvidia-utils
nvtop
vulkan-intel
vulkan-tools
vulkan-validation-layers

# ── AI / ML ───────────────────────────────────────────────────────────────────
ollama-cuda
opencode

# ── Audio & Video ─────────────────────────────────────────────────────────────
a52dec
cava
faac
faad2
ffmpeg
flac
gst-libav
gst-plugins-good
jasper
kdenlive
lame
libdca
libdv
libmad
libmpeg2
libtheora
libvorbis
libxv
obs-studio
pipewire
pipewire-alsa
#pipewire-jack
pipewire-pulse
vlc
wavpack
wireplumber
x264
xvidcore

# ── Fonts ─────────────────────────────────────────────────────────────────────
adobe-source-sans-fonts
aspell-en
enchant
hunspell-en_US
languagetool
libmythes
mythes-en
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-anonymous-pro
ttf-bitstream-vera
ttf-dejavu
ttf-droid
ttf-liberation
ttf-roboto
ttf-ubuntu-font-family

# ── Virtualization ────────────────────────────────────────────────────────────
dnsmasq
openbsd-netcat
qemu-full
swtpm
vde2
virt-manager
virt-viewer

# ── System & Hardware ─────────────────────────────────────────────────────────
android-tools
bluez
bluez-utils
cpufetch
cups
cups-pk-helper
efibootmgr
exfatprogs
fastfetch
figlet
flatpak
gufw
guvcview
hwinfo
intel-ucode
inxi
lm_sensors
mesa
mesa-utils
mission-center
ntfs-3g
nvm
os-prober
p7zip
7zip
pciutils
postgresql
rp-pppoe
rsync
samba
smartmontools
speedtest-cli
tar
touchegg
udisks2
ufw
unrar
unzip
usbutils
xorg-server
xorg-xinit
zip
zram-generator
glu

# ── Apps ──────────────────────────────────────────────────────────────────────
aria2
bleachbit
cameractrls
cmatrix
discord
drawio-desktop
epiphany
firefox-developer-edition
gimp
icedtea-web
inkscape
intellij-idea-community-edition
iotas
krita
libreoffice-fresh
mpv
mysql-workbench
potrace
pycharm-community-edition
qbittorrent
spotify-launcher
steam
telegram-desktop
thunderbird
